## dropna()

In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.DataFrame([[np.nan, 2, np.nan, 0], [3,3,np.nan,1],
                  [np.nan,np.nan,np.nan,5]],
                 columns=list('ABCD'))
df

     A    B   C  D
0  NaN  2.0 NaN  0
1  3.0  3.0 NaN  1
2  NaN  NaN NaN  5

In [5]:
# axis = 0 : 행
# how = 'all' : 모든 값이 np.nan일 때 적용
df.dropna(axis=0, how='all')

     A    B   C  D
0  NaN  2.0 NaN  0
1  3.0  3.0 NaN  1
2  NaN  NaN NaN  5

In [6]:
# axis = 1 : 열
df.dropna(axis=1, how='all')

     A    B  D
0  NaN  2.0  0
1  3.0  3.0  1
2  NaN  NaN  5

In [10]:
# how = 'any' : 하나의 값이라도 np.nan일 때 적용
df.dropna(axis=0, how='any')

Empty DataFrame
Columns: [A, B, C, D]
Index: []

In [11]:
# how = 'any' : 하나의 값이라도 np.nan일 때 적용
df.dropna(axis=1, how='any')

   D
0  0
1  1
2  5

## fillna()

In [13]:
df.fillna(0)

     A    B    C  D
0  0.0  2.0  0.0  0
1  3.0  3.0  0.0  1
2  0.0  0.0  0.0  5

In [15]:
# 해당 열에 있는 열값을 지정된 값으로 채움
values = {'A':0, 'B':1, 'C':2, 'D':3}
df.fillna(value=values)

     A    B    C  D
0  0.0  2.0  2.0  0
1  3.0  3.0  2.0  1
2  0.0  1.0  2.0  5

In [16]:
df

     A    B   C  D
0  NaN  2.0 NaN  0
1  3.0  3.0 NaN  1
2  NaN  NaN NaN  5

- 평균값으로 채우기

In [17]:
df['A'].mean()

3.0

In [19]:
df['D'].median()

1.0

In [20]:
df.fillna(df['D'].median())

     A    B    C  D
0  1.0  2.0  1.0  0
1  3.0  3.0  1.0  1
2  1.0  1.0  1.0  5

In [21]:
fill_na_value = df['D'].max()
fill_na_value

5

In [23]:
df.fillna(fill_na_value)

     A    B    C  D
0  5.0  2.0  5.0  0
1  3.0  3.0  5.0  1
2  5.0  5.0  5.0  5

In [24]:
df.isnull()

       A      B     C      D
0   True  False  True  False
1  False  False  True  False
2   True   True  True  False

In [26]:
df.isnull().sum()

A    2
B    1
C    3
D    0
dtype: int64

In [27]:
df.notnull()

       A      B      C     D
0  False   True  False  True
1   True   True  False  True
2  False  False  False  True

In [30]:
df.notnull().sum()

A    1
B    2
C    0
D    3
dtype: int64